Repository: bukun/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/deegree_quickstart.po
Languages: hu

source: deegree Quickstart
hu: deegree gyorstalpaló

source: deegree is a Java application for serving maps (and vector data) for other clients to show.
hu: degree egy térkép (és vektor adat) szolgáltató Java alkalmazás más kliensekben megjelenítéshez.

source: This Quick Start describes how to:
hu: Ez a gyorstalpaló leírja:

source: start deegree webservices
hu: deegree web szolgáltatások indítása

source: configure deegree webservices via the deegree services console
hu: deegree web szolgáltatások konfigurálása a deegree szolgáltatások konzolon keresztül

source: use the *deegree-inspire-workspace* as a starting point
hu: *deegree-inspire-workspace* használata kiindulópontként

source: Project description
hu: Projekt leírás

source: *deegree* is open source software for spatial data infrastructures and the geospatial web.
hu: *deegree* egí nyílt forráskódú szoftver a térinformatikai adat infrastruktúrákhoz és a térinformatikai web-hez.

source: Available components are:
hu: Elérhető komponensek:

source: Web-Services: WFS, WMS, WMTS, CSW, WPS
hu: Web szolgáltatások: WFS, WMS, WMTS, CSW, WPS

source: This quickstart describes how to:
hu: Ez a gyorstalpaló leírja:

source: Start *deegree 3 webservices* on the Live DVD
hu: Indítsa el a *deegree 3 webservices* a Live DVD-n

source: Use the *deegree 3 services console* to activate example configurations
hu: Használja a *deegree 3 services console*-t a példa konfigurációk aktiválásához

source: Find more information
hu: További információk

source: About deegree 3
hu: A deegre 3-ről

source: *deegree 3* is the new generation of the deegree Java framework for GIS applications and OGC-service implementations. It can be used to build web-based geospatial-data-infrastructures (GDI).
hu: *deegree 3* a deegree Java keretrendszer új generációja GIS alkalmazásokhoz és OGC szolgáltatások implementációjához. Web alapú téradat infrastruktúra (GDI) építésére használható.

source: Start deegree 3 webservices
hu: deegree3 web szolgáltatások indítása

source: Choose *'Start deegree'* from the :menuselection:`Geospatial --> Web Services --> deegree` menu. The application will take a few moments to start up.
hu: Válassza a *'Start deegree'*-t a :menuselection:`Geospatial --> Web Services --> deegree` menüből. Az alkalmazás néhány pillanat múlva elindul.

source: deegree 3 services console
hu: deegree3 web szolgáltatások konzol

source: When you start *deegree* for the first time, firefox should open (otherwise open it manually and point your browser to http://localhost:8033). Please wait until you can see the *deegree 3 services console*. This is a simple web-based GUI for editing the configuration files of the so-called *deegree workspace*.
hu: Amikor először indítja a *deegree*-t a firefox is megnyílik (különben nyissa meg és a http://localhost:8033 címre irányítsa a böngészőt). Kérjük várjon, amíg a *deegree 3 services console*-t nem látja. Ez egy egyszerű web alapú GUI a *deegree workspace*-nek nevezett konfiguráció fájlok szerkesztéséhez.

source: deegree 3 workspaces
hu: deegree 3 munkaterületek

source: *deegree 3* uses configurations conformant to all *deegree 3* based webservices. Those configurations are stored in the so called workspace.
hu: A *deegree 3* olyan konfigurációkat használ, mely megfelel minden *deegree 3* alapú web szolgáltatásnak. A konfigurációkat úgynevezett workspae-kben tároljuk.

source: Inside the *deegree services console* you find a section to manage the included and ready-to-use workspaces. To enter this section, click on *'workspaces'* on the left side.
hu: A *deegree services console*-on belül egy fejezetet találhat a használatra kész workspace-k kezelésére. Kattintson a bal oldali *'workspaces'*-re a fejezetbe belépéshez.

source: You are now in the workspace management of the running *deegree* instance. You can see which workspace is currently active (only one can be active at a time) workspace, inactive locally available workspaces and offical workspaces which can be imported if you have a internet connection.
hu: Most a futó *deegree* példány workspace kezelőjében van. Láthatja melyik workspace aktív (csak egy lehet aktív egyidőben), inaktív lokálisan elérhető workspace-ket és hivatalos workspace-ket importálhat, ha van internet kapcsolata.

source: Please start the *deegree-inspire-workspace* now.
hu: Kérjük most indítsa el a *deegree-inspire-workspace*-t.

source: deegree 3 workspaces on OSGeoLive GIS Disc
hu: deegree 3 wokspace-k az OSGeoLive GIS lemezen

source: This workspace includes an example configuration for INSPIRE View- and Download-Services. It consists of a transactional WFS (2.0.0 and 1.1.0) for all Annex I Data Themes and a WMS (1.3.0 and 1.1.1) which serves three layers of those Annex I Data Themes. Included are some harmonized dutch administrative units, cadastral parcels and addresses. The WFS in this example acts as an INSPIRE Download service (direct access) and outputs valid, harmonized INSPIRE GML. Additionally it supports multiple request types and queries.
hu: Ez a workpace egy minta INSPIRE nézet és letöltés szolgáltatás konfigurációt tartalmaz. Ez egy tranzakciós WFS-ből (2.0.0 és 1.1.0) és egy WMS-ből (1.3.0 és 1.1.1) áll, melyek az az I. függelék összes adattémái közül három réteget szolgáltatnak. Tartalmaz néhány holland adminisztrációs egységet, telkeket és címeket. A WFS ebben a példában mint egy INSPIRE letöltés szolgáltatás (közvetlen hozzáférés) szerepel és az eredménye helyes, harmonizált INSPIRE GML. Továbbá többféle kérdés típust és lekérdezést támogat.

source: This workspace loads harmonized INSPIRE GML from local files. This can easily changed to PostGIS, Oracle Spatial or Microsoft SQL Server as backend.
hu: Ez a workspace összhngban lévő INSPIRE GML helyi fájlokat tölt be. Ez könnyen megváltoztatható PostGIS, Oracel Spatial vagy Microsoft SQL server háttérre.

source: After activating the *deegree-workspace-inspire* you can open a simple map-client by clicking on *'see layers'*. The service is configured to visualize the data and a basemap (rendered by `OpenStreetMap <http://openstreetmap.org/>`_).
hu: A *deegree-workspace-inspire* aktiválása után egy egyszerű térkép klienst nyithat meg a *'see layers'*-re kattintva. A szolgáltatást az adatok és egy alaptérkép (`OpenStreetMap <http://openstreetmap.org/>`_) megjelenítésére konfigurálták.

source: A click on the **+** on the right side opens a layer tree showing all available layers. You can activate the INSPIRE layer served by the deegree WMS here.
hu: A jobb oldali *+**-ra kattintva megnyitja az összes elérhető réteget tartalmazó réteg fát. Itt kapcsolhatja be a deegree WMS által szolgáltatott INSPIRE réteget.

source: The map client is based on `OpenLayers <http://openlayers.org/>`_. You can pan through the map holding the left mouse button and drag the map. Zooming is possible via mouse wheel or the navigation elements on the left side.
hu: A térkép kliens az `OpenLayers-re <http://openlayers.org/>`_ épül. A térkép eltolásához tartsa a egér bal gombját lenyomva és húzza a térképet. A nagyítás az egérgörgő vagy a bal oldali navigációs elemek segítségével lehetséges.

source: Want more?
hu: Többet akar?

source: This was just a short intro on the features of deegree 3. There is more information in the demo installations and on the deegree website.
hu: Ez csak egy rövid bemutatkozás volt a deegree 3 funkcióiról. Több információ érhető el a demó telepítésben és a deegree honlapon.

source: deegree online demo
hu: deegree online demó

source: Available here: http://demo.deegree.org
hu: Elérhető itt: http://demo.deegree.org

source: deegree website
hu: deegree honlap

source: Available here: http://www.deegree.org
hu: Elérhető itt: http://www.deegree.org
