Repository: bukun/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/geomajas_quickstart.po
Languages: de, hu

source: Geomajas Quickstart
hu: Geomajas gyorstalpaló

source: Geomajas itself is an application framework allowing you to build very diverse and advanced web GIS solutions.
de: Geomajas ist ein Anwendungsframework, welches die Entwicklung von sehr diversen und fortgeschrittenen Web GIS Lösungen ermöglicht.
hu: A Geomajas maga egy alkalmazás keretrendszer, mely szerteágazó és kifinomult webes GIS megoldások készítését teszi lehetővé.

source: On this OSGeo Live DVD we have included a ready-to-use Geomajas Application. This application features a map, navigation controllers, several data layers, a ribbon toolbar with GIS tools and the Layer Tree.
de: Diese OSGeo Live DVD beinhaltet eine verwendugsbereite Geomajas Anwendung. Die Anwendung ist mit einer Karte, Navigationskontrolle, mehreren Datenebenen und einer Werkzeugleise mit GIS Tools und einem Ebenen Baum ausgestattet.
hu: Az OSGeoLive DVD-hez használatra kész Geomajas alkalmazást helyeztünk el. Ez az alkalmazás egy térképet, navigációs vezérlőket, számos adat réteget, egy eszköztárat GIS eszközökkel és a réteg fát tartalmazza.

source: Getting started
de: Erste Schritte
hu: Kezdjen neki

source: Geomajas is both available as a web demo or as a standalone application.
de: Geomajas ist sowohl als Web Demo und als alleinstehende Anwendung verfügbar.
hu: A Geomajas mint egy webes demó vagy mint egy önálló alkalmazás is elérhető.

source: To continue using the web demo visit `<http://www.geomajas.org/demo>`_.
de: Um die Web Demo weiter zu nutzen besuche `<http://www.geomajas.org/demo>`_.
hu: A web demó használatának a folytatásához keresse fel a `<http://www.geomajas.org/demo>`_ oldalt.

source: To continue using the stand-alone application, visit `<http://files.geomajas.org/downloads/2.3.0/geomajas-standalone-gwt2.zip>`_.
de: Um die alleinstehende Anwendung zu nutzen, besuche `<http://files.geomajas.org/downloads/2.3.0/geomajas-standalone-gwt2.zip>`_.
hu: Az önálló alkalmazás használatának folytatásához keresse fel a <http://files.geomajas.org/downloads/2.3.0/geomajas-standalone-gwt2.zip>`_ oldalt.

source: When using the stand-alone application, run either startup.bat on Windows, or startup.sh on Linux and Mac. You can then access the application using the following URL: `<http://localhost:8080/geomajas/>`_. When you’re finished using the application, the application can be terminated by running shutdown.bat or shutdown.sh.
de: Um die alleinstehende Anwendung zu nutzen, verwende die startup.bat auf Windows, oder startup.sh aus Linux oder Max OSX. Die Anwendung kann dann über die URL `<http://localhost:8080/geomajas/>`_ genutzt werden. Die Anwendung kann nach der Nutzung über die shutdown.bat bzw. shutdown.sh geschloßen werden.
hu: Az önálló alkalmazás használatához vagy futtassa a startup.bat fájlt Windowson vagy a startup.sh fájl Linux-on és Mac-en.Az alkalmazást a következő URL-en keresztül érheti el: `<http://localhost:8080/geomajas/>`_. Amikor az alkalmazás használatát befejezte, a shutdown.bat vagy a shutdown.sh futtatásával zárhatja le azt.

source: Using Geomajas applications
de: Nutzung der Geomajas Anwendung
hu: A Geomajas alkalmazás használata

source: Looking around
de: Sich umschauen
hu: Nézzünk körül

source: You can drag around the map with the mouse so the desired area is centered on your screen.
de: Sie können die Karte mit der Maus bewegen um das gewünschte Areal auf dem Bildschirm darzustellen
hu: Húzhatja a térképet az egérrel, hogy a kívánt területet középre hozza a képernyőn.

source: To get a closer look, you can either use the mousewheel to zoom in or use the provided zoom-buttons in the upper left of the application. You can also select an area to show by clicking the magnifier icon and selecting the desired area (via rectangular select).
de: Sowohl das Mausrad als auch die bereitstehenden Zoom Buttons rechts oben können genutzt werden um sich in der Anwendung einen besseren Überblick zu verschaffen. Ebenso kann ein Areal mithilfe des Lupen icons und der rechteck Auswahl aufgerufen werden.
hu: Egy közelebbi nézethez használhatja az egérgörgőt vagy használja a nagyítás gombot az alkalmazás bal-felső sarkában. Kiválaszthatja a megjelenítendő területet a nagyító ikonnal kattintva és a kívánt terület kiválasztásával (téglalap kiválasztással).

source: Legend
de: Legende
hu: Jelmagyarázat

source: In the upper right, a toggleable legend box is provided. This legend gives you an overview of all the layers currently loaded into the application, with the option to turn them on or off. This also shows more detailed info about each layers regarding icons, colouring, …
de: Oben rechts ist eine einschaltbare Legende. Die Legende gibt einen Überblick über alle Ebenen welche gegenwärtig in der Anwendung geladen sind mit der Option diese ein- bzw. auszublenden. Ebenso gibt es mehr detaillierte Informationen über jede einzelne Ebene bezüglich Icons, Farben etc, ...
hu: Jobbra fent egy kikapcsolható jelmagyarázat téglalap található. Ez a jelmagyarázat egy áttekintést ad az alkalmazásba aktuálisan betöltött össze rétegről, a ki-, bekapcsolás lehetőségével. Részletes információt is megjelenít az egyes rétegekről az ikonra, a színekre, stb. vonatkozóan.

source: Gathering information
de: Informationen sammeln
hu: Információ gyűjtés

source: Geomajas applications have the ability to display a variety of info within the layers. Clicking on the map will display the related info if available. By clicking the info icon in the upper left, you can toggle between basic or more detailed information.
de: Geomajas Anwendungen sind in der Lage eine Reihe von Informationen innerhalb der Ebenen darzustellen. Durch das klicken auf die Karte werden zugehörige Informationen dargestellt. Durch das Info icon im linken oberen Teil kann zwischen der einfachen und detaillierteren Informationsübersicht gewechselt werden.
hu: A Geomajas alkalmazás képes a rétegeken belüli számos információ megjelenítésére. A térképre kattintva megjelenik a kapcsolódó információ, ha elérhető. A bal felső info ikonra kattintva válthatunk az alap és részletes információk között.

source: Customizing Geomajas applications
de: Anpassen von Geomajas Anwedungen
hu: Geomajas alkalmazás testreszabása

source: If you want to use this sample application to build and customize your own Web GIS solution … please visit `<http://www.geomajas.org/client-gwt>`_. The download page always features the latest and greatest sample applications, documentation, tips and tricks to roll-your-own.
de: Bitte besuchen sie `<http://www.geomajas.org/client-gwt>`_ um eine eigene Web GIS Lösung auf der Basis dieser Beispielanwendung zu bauen und anzupassen. Die Downloadseite bietet immer die neuesten und besten Beispielanwendungen, Dokumentation, Tips und Tricks als Startpunkt für neue Anwendungen.
hu: Ha ezt a minta alkalmazást akarja használni a saját Web GIS megoldásának elkészítéséhez és testreszabásához, kérjük látogassa meg a `<http://www.geomajas.org/client-gwt>`_ oldalt. A letöltés oldal mindig a legújabb és legjobb minta alkalmazásokat, dokumentációt, tippeket és trükköket tartalmazza, hogy elkészíthesse a sajátját.

source: What next?
de: Was kommt als Nächstes?
hu: Mi a következő?

source: Interested in learning more about Geomajas? The following links provide more detailed info:
de: Interesse mehr über Geomajas zu lernen? Mehr detaillierte Informationen sind auf den vollgenden Links zu finden:
hu: Többet szeretne megtanulni a Geomajas-ról? A következő linkeken részletesebb információt talál:
