Repository: bukun/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/josm_quickstart.po
Languages: hu

source: JOSM Quickstart
hu: JOSM gyorstalpaló

source: This quickstart covers basic usage of the Java OpenStreetMap editor.
hu: Ez a gyorstalpaló a Java OpenStreetMap szerkesztő alapvető használatáról szól.

source: When JOSM starts, it will look something like this:
hu: Amikor a JOSM elindul valahogy így fog kinézni:

source: JOSM Preferences
hu: JOSM preferenciák

source: There are many different settings that you can customize in JOSM. One setting that you may want to adjust is the language. JOSM has been translated into numerous languages, and you may prefer to work in a different one.
hu: Sok különböző testreszabható beállítás van a JOSM-ben. A nyelv egy beállítás amit módosítani akarhat. Számos nyelvre lefordították a JOSM-t és lehet, hogy egy másikkal dolgozna.

source: To access the Preferences window, click Edit -> Preferences.
hu: A preferencia menü eléréséhez kattintson az Edit -> Preferences menüpontra.

source: On the left side, click the icon that looks like a paint can and paint brush.
hu: A bal oldalon kattintson az ikonra, mely úgy néz ki, mint egy festékes doboz és ecset.

source: At the top of the window, click the tab that says “Look and Feel”.
hu: Az ablak tetején kattintson a “Look and Feel” fülre.

source: Choose your language in the dropdown box next to the word “Language”.
hu: Válassza ki a nyelvét a legördülő listából a “Language” szó mellett.

source: Click OK.
hu: Kattintson az OK-ra

source: You need to restart JOSM to save your settings. Click “File” in the upper left corner, and Click “Restart” near the bottom of the menu.
hu: Újra kell indítania a JOSM-t a beállítások mentéséhez. Kattintson a "File"-ra bal felső sarokban és kattintson a "Restart"-ra közel a menü aljához.

source: Learn Basic Drawing with JOSM
hu: JOSM rajzolási alapok megtanulása

source: Now let’s open up a sample OSM file which we will use to learn the basic ways to draw maps with JOSM. Note that this map is not real, in that it is not a real map of a real place, so we will not save it on OpenStreetMap.
hu: Most nyissuk meg egy minta OSM fájlt, melyet a JOSM alap térkép rajzolási módok megtanulására használunk. Vegye figyelembe ez a térkép nem valós, ez nem egy valódi hely valódi térképe, így ezt nem fogjuk az OpenStreetMap-be menteni.

source: Download the file here: `sample.osm <http://learnosm.org/files/sample.osm>`__
hu: Töltse le a fájlt innen: `sample.osm <http://learnosm.org/files/sample.osm>`__

source: Now let’s open the sample map file in JOSM. Click the “Open” button in the upper left.
hu: Most nyissuk meg a minta térkép fájlt a JOSM-ban. Kattintson az "Open" gombra a bal felső sarokban.

source: Find the file **sample.osm**. It is probably in your Downloads folder, unless you saved it somewhere else. Click on it, and then click “Open”.
hu: Keresse meg a **sample.osm** fájlt. Valószínűleg a a letöltések mappájában van, hacsak nem mentette valahová máshová. Kattintson rá és utána az "Open"-re.

source: You should now see a sample map that looks like this:
hu: Egy minta térképet kell látnia, mely ehhez hasonlóan néz ki:

source: You will use these data in order to try various editing techniques. *You must however never upload these fictitious data to the database.*
hu: Ezeket az adatokat használjuk a különböző szerkesztési technikák kipróbálásához. *Nem szabad ezeket a fiktív adatokat az adatbázisba feltöltenie.*

source: Basic Operations
hu: Alapműveletek

source: To move the map left or right, up or down, hold your right mouse button down, and move your mouse.
hu: A térkép balra vagy jobbra, fel vagy le mozgatásához tartsa nyomva a jobb egérgombot és mozgassa az egeret.

source: There are several ways to zoom in and out of the map. If you have a mouse, you can use your scroll wheel to zoom in and out. If you are using a laptop and don’t have a mouse, you can zoom in and out using the scale bar in the upper left of the map window. Drag the bar left and right by holding your left mouse down and moving the bar left or right with your mouse.
hu: Több lehetőség van a térkép nagyítására, kicsinyítésére. Ha vagy egy egere, használhatja az egérgörgőt a nagyításra és kicsinyítésre. Ha egy laptopot használ és nincs egere, akkor a térkép ablak bal-felső részén található léptékvonalzót használhatja. Húzza a vonalzót jobbra és balra a bal egérgomb nyomvatartása mellett.

source: Look at the sample map. There a few different types of objects here. There is a river, a forest, some buildings, several roads, and a couple of shops. To select an object, click on it with your left mouse button.
hu: Nézzen a minta térképre. Kevés különböző objektum típus van itt. Egy folyó, egy erdő, néhány épület, számos út és pár üzlet. Egy objektum szelektálásához a bal egérgombbal kattintson rá.

source: Points, Lines, and Shapes
hu: Pontok, vonalak és alakzatok

source: As you click different objects on the sample map, notice that there are three different types of objects on the map. There are points, lines, and shapes.
hu: Vegye észre, ahogy a különböző objektumokra kattint a minta térképen, három különböző típusú objektum van a térképen. Pontok, vonalak és alakzatok vannak.

source: Points are a single location, represented by symbols. On this sample map, there are two points, a shoe shop and a supermarket. The shoe shop is represented by a shoe symbol, and the market is represented by a shopping cart.
hu: A pontok egy szimbólummal reprezentált pozíciók. Ezen a minta térképen két pont van egy cipőbolt és egy áruház. A cipőboltot a cipő szimbólummal jelöltük, az áruházat egy bevásárló kocsival.

source: There are several lines on the map as well, which represent roads. If you look closely you will see that within the lines, there are points as well. These points don’t have any symbols or other information associated with them, but they help to define where the line is located.
hu: Sok vonal is található a térképen, melyek az utakat ábrázolják. Ha közelebbről megtekinti láthatja, hogy a vonalakon pontok is vannak. Ezekhez a pontokhoz nem tartozik szimbólum vagy más információ, a vonal helyét határozzák meg csupán.

source: Lastly, there are numerous shapes on the sample map, representing different places - a forest, a river, a park, and buildings. A shape is used to represent an area, like a field or a building. A shape is exactly like a line - the only difference is that the line begins at the same point where it ends.
hu: Végül számos alakzat van a minta térképen, melyek különböző helyeket reprezentálnak - egy erdőt, egy folyót, egy parkot és épületeket. Az alakzatot egy terület reprezentálására használjuk, mint például egy mező vagy épület. Az alakzatok pontosan olyanok mint a vonalak - az egyetlen különbség, hogy a vonal kezdő és végpontja megegyezik.

source: It's easy to think of a map as containing these three basic types of objects - points, lines, and shapes. In OpenStreetMap there is special terminology which you will come to learn as you progress. In OSM, points are actually called **nodes**, and lines are called **ways**. A shape is called a **closed way** because it is just a line that ends at the same point where it begins.
hu: Könnyen elképzelhető, hogy egy térkép ezt a három objektum típust tartalmazza - pontok,vonalak és alakzatok.Az OpenStreetMap-ben speciális terminológiát használunk, melyet megtanul, ahogy előre haladunk. Az OSM-ben a pontokat **csomópontoknak** és a vonalakat **utaknak** nevezzük. Egy alakzatot **zárt útnak** nevezünk, mert ez egy vonal mely ugyanabban a pontban végződik ahonnan indult.

source: You may notice that when you select an object, a list appears to the right of the map in a window called “Properties”. These are known as tags. Tags are information that is tied to a point, line or shape that describes what it is. We’ll learn more about tags in a later chapter. For now all you need to know is that this information helps describe whether our object is a forest, a river, a building, or something else.
hu: Megfigyelheti, hogy amikor egy objektumot kiválaszt egy lista jelenik meg a térkép jobb oldalán a “Properties” nevű ablakban. Ezeket mint tegeket ismerjük. A tegek olyan információk,melyeket egy ponthoz, vonalhoz vagy alakzathoz kötöttünk, hogy leírja mi az. Többet tanulunk a tegekről a további fejezetekben. Most csak annyit kell tudnia, hogy ezek az információk segítenek az objektumunk leírásában, hogy egy erdőről, egy folyóról, egy épületről vagy valami másról van szó.

source: Think about drawing a map by hand, and how you are also drawing points, lines, and shapes. What other places are best represented by points? Lines? Shapes?
hu: Gondoljon egy kézzel rajzolt térképre, hogyan rajzol pontokat, vonalakat és alakzatokat. Milyen más helyeket reprezentálnak legjobban pontok, vonalak, alakzatok?

source: Changing Objects
hu: Objektumok módosítás

source: Select the forest on the left side of the map. Be sure to click on the line around the forest, not one of the points on the line. Now hold your left mouse button down and drag your mouse. You should be able to move the forest to a new location on the map.
hu: Válassza ki az erdőt a térkép bal oldalán. Győződjön meg róla, hogy az erdő körüli vonalra kattint és nem az egyik pontra a vonalon. Tartsa nyomva a bal egérgombot és húzza az egeret. El tudja húzni az erdőt egy új helyre a térképen.

source: Click on one of the points on the line around the forest. Hold your left mouse button down and drag your mouse. You should be able to move the point. This is how you can change the shape of an object, or move a point.
hu: Kattintson az erdőt körülvevő vonal egyik pontjára. Tartsa nyomva a bal egérgombot és húzza az egeret. Mozgatni tudja a pontot. Így tudja módosítani az objektum alakját vagy egy pontot mozgatni.

source: Drawing
hu: Rajzolás

source: On the left side of JOSM is a column of buttons. Many of these buttons open new windows on the right side that provide more information about the map. The most important buttons, however, are at the top of these column. These buttons change what you can do with your mouse.
hu: A JOSM jobb oldalán a gombok oszlopa van. Sok ezen gombok közül egy új ablakot nyit meg a jobb oldalon, mely további információt ad a térképről. Legfontosabb gombok azonban az oszlop tetején találhatók. Ezek a gombok megváltoztatják, hogy mit tud csinálni az egérrel.

source: The top buttons in this column are the ones you will use the most. They are used for selecting objects and for drawing new ones.
hu: A felül lévő gombok azok, melyeket a legtöbbet fog használni. Ezeket az objektumok kiválasztására és újak rajzolására használjuk.

source: Until now, you have been using the Select tool, which looks like this:
hu: Idáig a kiválasztás eszközöket használtuk, melyek így néznek ki:

source: Before you draw, you need to make sure that nothing is selected. Click in the black space on the map, where it is empty, to make sure nothing is selected.
hu: A rajzolás előtt legyen biztos benne, hogy nincs kiválasztott elem. Kattintson a fekete területbe a térképen, ahol nincs semmi, hogy semmi se legyen szelektálva.

source: Click on the second button, the Draw tool.
hu: Kattintson a második ikonra, a Draw eszközre.

source: Find an empty area on the map, and double-click with your mouse. This will draw a single point.
hu: Keressen egy üres terültet a térképen és duplán kattintson az egérrel. Ez egy pontot fog rajzolni.

source: To draw a line, single-click with your mouse. Move your mouse and click again. Continue until you are happy with your line. To end the line, double-click your mouse.
hu: Egy vonal rajzolásához kattintson egyszer. Mozgassa az egerét és kattintson ismét. Folytassa amíg elégedett lesz a vonalával. vonal lezárásához kattintson duplán az egerével.

source: Draw a shape the same way that you draw a line, but finish the shape by double-clicking on the point where you started the line.
hu: Rajzoljon egy alakzatot ugyanúgy ahogy vonalat rajzol, de az alakzat befejezéséhez duplán kattintson a pontra, ahol elkezdte a vonalat.

source: Add Presets
hu: Beállítások hozzáadása

source: Now we know how to draw points, lines and shapes, but we still haven’t defined what they represent. We want to be able to say that our points are shops, schools, or something else, and whether our shapes are fields, buildings, or something else.
hu: Most már tudjuk hogyan rajzoljunk pontokat, vonalak és alakzatokat, de még nem adtuk meg, hogy mit reprezentálnak. Az akarjuk, hogy megmondhassuk a pontjaink üzletek, iskolák vagy valami más és az alakzataink mezők, épületek vagy valami más.

source: Click on the Select tool, in the column of buttons on the left.
hu: Kattintson a Select eszközre a bal oldali gomb oszlopban.

source: Select one of the objects that you drew with the Draw tool. On the top menu, click “Presets”. Move your mouse through the sub-menu to the type of location you would like to define.
hu: Válasszon ki egyet a Draw eszközzel rajzolt objektumok közül. A felő menüben kattintson a “Presets”-re. Mozgassa az egeret végig az almenün addig a hely típusig amit definiálni szeretne.

source: When you click on a preset, a form will pop up asking you for more information. You do not have to fill in every field, but you may wish to add some of the important fields, such as the name of the object.
hu: Amikor egy beállításra kattint egy űrlap bukkan fel további információkat kérve. Nem kell minden mezőt kitöltenie, de érdemes néhány mezőt felvenni mint például az objektum neve.

source: When you are finished entering the information, click “Apply Preset”. If everything went well, your point, line, or shape should change colors or show a symbol. This is because you have defined what it is.
hu: Amikor befejezte a az adatok bevitelét kattintson az “Apply Preset”-re. Ha minden jól ment a pont, a vonal vagy alakzat színe megváltozik vagy egy szimbólum jelenik meg. Ez azért történik, mert megadta, hogy mi az.

source: Draw Your Own Map
hu: Saját térkép rajzolása

source: Now let’s draw a map in order to practice the techniques you have learned. You may wish to redraw the map that you drew on paper previously.
hu: Most rajzoljunk egy térképet, hogy gyakoroljuk a technikákat amit eddig tanult. Újra elkészítheti a térképet, melyet az előző lapokon rajzolt.

source: Drag the map away from the sample map. Hold the right mouse button and drag your mouse, until you have a nice empty area to draw on.
hu: Húzza el a térképet a minta térképből. Tartsa nyomva a jobb egér gombot és húzza az egeret amíg egy üres területet kap a rajzoláshoz.

source: Use the Draw tool to create points, lines, and shapes. Describe what your objects are by selecting from the Presets menu.
hu: Használja a Draw eszközt pontok, vonalak és alakzatok létrehozására. Írja le mik ezek az objektumok, a Preset menüből kiválasztva.

source: When you are finished, you should have your own map, similar to the sample map that we opened in sample.osm.
hu: Amikor befejezte egy saját térképpel rendelkezik, hasonló a minta térképhez, melyet a sample.osm tartalmazott.

source: Remove the sample layer
hu: Távolítsa el a minta réteget

source: Once you feel comfortable with these basic editing techniques you might want to turn your attention to mapping real features.
hu: Ha már megismerte az alapvető szerkesztési technikákat érdemes lenne a figyelmét a valós elemek térképezésére.

source: *It is very important that you first remove the layer with the sample data. These data are fictitious and must not be uploaded to the OpenStreetMap database (newer JOSM releases automatically prevent this).*
hu: *Nagyon fontos, hogy először eltávolítsa a réteget a minta adatokkal. Ezek fiktív adatok és nem szabad feltölteni őket az OpenStreetMap adatbázisba (újabb JOSM kiadások automatikusan meggátolják ezt).*

source: In the Layers window on the upper right of the screen select the sample.osm layer. Then click on the trash can icon in the lower right corner of that window. Alternatively you can choose delete from the context menu of the layer.
hu: A Layers ablakban a képernyő jobb felső részén válassza a sample.osm réteget. Majd kattintson a szemétláda ikonra annak az ablaknak jobb alsó sarkában. A réteg helyi menüjéből is kiválaszthatja a törlést alternatív megoldásként.

source: What Next?
hu: Mi a következő?

source: Try the LearnOSM documentation, from which this quickstart was derived: http://learnosm.org/en/josm/start-josm/
hu: Próbálja meg a LearnOSM dokumentációt, melyből ezt a gyorstalpalót készítettük: http://learnosm.org/en/josm/start-josm/

source: In order to continue editing you first need to download real data. This is explained in the next chapter: http://learnosm.org/en/josm/more-about-josm/
hu: A szerkesztés folytatásához először valós adatokat kell letöltenie. Ezt a következő fejezetben magyarázzuk el: http://learnosm.org/en/josm/more-about-josm/
