Repository: bukun/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/zoo-project_quickstart.po
Languages: fi

source: Zoo Project Quickstart
fi: Zoo projektin pika-aloitus

source: The ZOO-Project provides a developer friendly Web Processing Service (WPS) framework for creating and chaining Web Processing Services. A WPS provides web access to functions which run spatial algorithms.
fi: ZOO-projekti tarjoaa kehittäjäystävällisen Web Processing Service (WPS) -rakenteet WPS:n luomiseen ja ketjuttamiseen. WPS tarjoaa verkossa pääsyn toimintoihin jotka suorittavat paikkatietoalgoritmeja.

source: This Quick Start describes how to:
fi: Tämä pika-aloitus kuvailee kuinka:

source: Apply processes to a WFS from a web browser.
fi: Käytä prosesseja WFS: ään web-selaimesta.

source: Running
fi: Suorittaminen

source: To run the ZOO Project demo from the OSGeoLive DVD, click on the "ZOO Project" link you will find it in the menu-items under "Geospatial" > "Web Services".
fi: Suorittaaksesi ZOO projektin demon OSGeoLive DVD:tä klikkaa "Zoo Project" linkkiä jonka löydät valikon "Geospatial" > "Web Services" otsikkovalinnoista.

source: Firefox will open the ZOO Project demonstration landing page. From here, you can decide what is the demonstration you want to use.
fi: Selain avaa Zoo projektin esittelyn aloitussivun. Täällä voit päättää mitä esittelyä haluat käyttää.

source: OGR spatial tools
fi: OGR spatiaaliset työkalut

source: Click on the map to select a feature from the :doc:`GeoServer <../overview/geoserver_overview>` WFS Server, the feature will be displayed in blue, then click on simple geometry process like Buffer, Centroid, ConvexHull or Boundary and the result will be displayed in yellow.
fi: Klikkaa kartalla valitaksesi ominaisuuden :doc:`GeoServer <../overview/geoserver_overview>` WFS palvelimelta, ominaisuus näytetään sinisellä, tämän jälkeen klikkaa yksinkertaista geometria prosessia kuten Buffer, Centroid, ConvexHull tai Boundary ja tulokset näytetään keltaisella.

source: Now select another feature near the first you've selected then click on multiple geometries process button Union, Intersection, Symmetric Difference or Difference to get the result displayed in red on the map.
fi: Nyt valitse toinen ominaisuus läheltä ensimmäistä valintaasi ja klikkaa monigeometrian prosessin näppäintä Union, Intersection, Symmetric Difference tai Difference saadaksesi näkyviin tulokset kartalla punaisena.

source: CGAL triangulations
fi: CGAL kolmiointi

source: From the CGAL triangulations application, you simply have to press the Voronoi or Delaunay button to display on your map the result of the WPS service execution, as shown bellow.
fi: CGAL sovellutuksessa tulee Sinun yksinkertaisesti painaa Voronoi tai Delaunay näppäintä näyttääksesi WPS palvelun suorituksen tulokset kuten on näytetty alla.

source: OTB Applications
fi: OTB sovellutukset

source: From the OTB application demonstration interface, you have to fill the form on the left to configure the WPS service execution. Once, you have selected the value for your processing, you can then press the Execute button at the bottom of the left form. In case you choose image/png as the output format, you will see the result of your processing displayed on the map. You can see below a sample KMeansClassification execution when selecting the image/png output format.
fi: OTB esittelyn demonstraation liitännässä, Sinun on täytettävä lomake vasemmalla konfiguroidaksesi WPS palvelun suorituksen. Kun olet valinnut arvot prosessointiisi voit painaa Execute näppäintä lomakkeella alhaalla vasemmalla. Jos valitsit image/png tulosteen tulosteen tyypiksi, näet prosessointisi tulokset näytettävän kartalla. Näet alla esimerkin KMeansClassification suorituksesta kun image/png on valittu tulosteen tyypiksi.

source: What Next?
fi: Mitä seuraavaksi?

source: You can access the capabilities of the ZOO WPS Server:
fi: Voit käyttää ZOO WPS -palvelimen ominaisuuksia:

source: For further questions you can contact the ZOO Project mailing list: zoo-discuss@lists.osgeo.org
fi: Lisäkysymyksillä voit ottaa yhteyttä Zoo Projektin postituslistalla: zoo-discuss@lists.osgeo.org
